tutorials/compressible/rhoCentralFoam/biconic25-55Run35/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;
interpolationScheme cellPointFace;
setFormat       raw;

fields          ( p wallHeatFlux );

sets
(
    cone25
    {
        type    lineFace;
        axis    x;
        start   (0 0 0);
        end     (0.09208087 0.042939 0);
        nPoints 92;
    }
    cone55
    {
        type    lineFace;
        axis    x;
        start   (0.09208087 0.042939 0);
        end     (0.153683 0.13092 0);
        nPoints 61;
    }
    base
    {
        type    lineFace;
        axis    x;
        start   (0.153683 0.13092 0);
        end     (0.193675 0.13092 0);
        nPoints 40;
    }
);

// ************************************************************************* //
